test/performance/src/smoke.yml
config:
  target: 'https://lpg.test.cshr.digital'
  phases:
    - duration: 60
      arrivalRate: 1
  processor: "./artilleryfunc.js"
  defaults:
  payload:
    # path is relative to the location of the test script
scenarios:
  - flow:
    - get:
        url: "/sign-in"
        beforeRequest: "setAuthHeader"
        afterResponse: "sessionDataKey"
    - post:
        url: "https://identity.test.cshr.digital/commonauth"
        beforeRequest: "setLoginBody"
    - get:
        url: "/home"
        beforeRequest: "setAuthHeader"
        afterResponse: "sessionDataKey"