test/performance/src/smoke.yml
config:
  target: 'https://lpg.demo.cshr.digital'
  phases:
    - duration: 60
      arrivalRate: 20
  processor: "./artilleryfunc.js"
  defaults:
  payload:
    # path is relative to the location of the test script
scenarios:
  - flow:
    - get:
        url: "/sign-in"
        beforeRequest: "setAuthHeader"
        afterResponse: "sessionDataKey"
    - post:
        url: "https://identity.test.cshr.digital/commonauth"
        beforeRequest: "setLoginBody"
    - get:
        url: "/home"
        beforeRequest: "setAuthHeader"
    - get:
        url: "/search?q=commercial"
        beforeRequest: "setAuthHeader"
    - get:
        url: "/suggestions-for-you/add/I1Uf3KPkSTmirf5DN5b08Q?ref=search"
        beforeRequest: "setAuthHeader"