test/performance/src/smoke.yml
config:
  target: 'https://test-lpg.cshr.digital'
  phases:
    - duration: 200
      arrivalRate: 1
  processor: "./artilleryfunc.js"
  defaults:
  payload:
    path: 'users.csv'
    fields:
      - "username"
      - "password"
    order: "sequence"
    # path is relative to the location of the test script
scenarios:
  - flow:
    - get: 
        url: "/home"
        capture:
          selector: "input[type='hidden']"
          as: "csrf"
    - post:
        url: "https://test-identity.cshr.digital/login"
        username: "{{ username }}"
        password: "{{ password }}"
        beforeRequest: "setLoginBody"
    - get:
        url: "/home"
    - get:
        url: "/search?q=commercial"
    - get:
        url: "/suggestions-for-you/add/e0HNfmkTSMiRPHVJ9ljnxA?ref=search"