test/performance/src/smoke.yml
config:
  target: 'http://localhost:3001'
  variables:
    identityUrl:
      - "http://localhost:8080/login"
  phases:
    - duration: 1500
      arrivalCount: 500
  processor: "./artilleryfunc.js"
  defaults:
  payload:
    path: 'users.csv'
    fields:
      - "username"
      - "password"
    order: "sequence"
scenarios:
  - name: "Login to LPG"
    flow:
    - get:
        url: "/home"
        capture:
          selector: "input[type='hidden']"
          as: "csrf"
    - post:
        url: "{{ identityUrl }}"
        username: "{{ username }}"
        password: "{{ password }}"
        beforeRequest: "setLoginBody"
    - get:
        url: "/home"
    - get:
        url: "/search?q=commercial"
    - get:
        url: "/suggestions-for-you/add/e0HNfmkTSMiRPHVJ9ljnxA?ref=search"
    - get:
        url: "/courses/E-5tkB8fQN-IrK4dKpzwsg/cV1QRIfiS9-kBqN5rxALoQ"