test/performance/src/smoke.yml
config:
  target: 'https://test-lpg.cshr.digital'
  phases:
    - duration: 1
      arrivalRate: 1
    - pause: 5
    - duration: 60
      arrivalRate: 20
  processor: "./artilleryfunc.js"
  defaults:
  payload:
    # path is relative to the location of the test script
scenarios:
  - flow:
    - get: 
        url: "/home"
        capture:
          selector: "input[type='hidden']"
          as: "csrf"
    - post:
        url: "https://test-identity.cshr.digital/login"
        beforeRequest: "setLoginBody"
    - get:
        url: "/home"
    - get:
        url: "/search?q=commercial"
    - get:
        url: "/suggestions-for-you/add/e0HNfmkTSMiRPHVJ9ljnxA?ref=search"