test/performance/src/smoke.yml
config:
  target: 'https://test-lpg.cshr.digital'
  phases:
    - duration: 1
      arrivalRate: 1
    - pause: 60
    # - duration: 60
    #   arrivalRate: 20
  processor: "./artilleryfunc.js"
  defaults:
  payload:
    # path is relative to the location of the test script
scenarios:
  - flow:
    - get: 
        url: "/home"
        capture:
          selector: "input[type='hidden']"
          as: "_csrf"
        afterResponse: "logHeaders"
    - post: 
        url: "https://test-identity.cshr.digital/login"
        formData: 
          username: 'load@domain.com'
          password: 'test'
          _csrf: $._csrf
        afterResponse: "logHeaders"
    - get: 
        url: "/home"
        afterResponse: "logHeaders"