test/performance/src/smoke.yml
config:
  target: 'https://lpg.cshr.digital'
  phases:
    - duration: 0
      arrivalRate: 1
    - pause: 5
    - duration: 60
      arrivalRate: 20
  processor: "./artilleryfunc.js"
  defaults:
  payload:
    # path is relative to the location of the test script
scenarios:
  - flow:
    - get:
        url: "/home"
        afterResponse: [sessionDataKey, loginToWso2]
    - get:
        url: "/search?q=commercial"
        beforeRequest: "useCookie"
    - get:
        url: "/suggestions-for-you/add/e0HNfmkTSMiRPHVJ9ljnxA?ref=search"
        beforeRequest: "useCookie"