test/performance/src/smoke.yml
config:
  target: 'https://lpg.cshr.digital'
  phases:
    - duration: 60
      arrivalRate: 1
  processor: "./artilleryfunc.js"
  defaults:
  payload:
    # path is relative to the location of the test script
scenarios:
  - flow:
    - get:
        url: "/sign-in"
        afterResponse: "sessionDataKey"
    - post:
        url: "https://identity.cshr.digital/commonauth"
        beforeRequest: "setLoginBody"
    - get:
        url: "/home"
    - get:
        url: "/search?q=commercial"
    - get:
        url: "/suggestions-for-you/add/I1Uf3KPkSTmirf5DN5b08Q?ref=search"